<?php

return [
    "add" => "Добавить в корзину",
    'clear' => 'Очистить корзину',
    "button" => [
        "view" => "Посмотреть корзину",
        "open" => "Открыть корзину",
    ],
    "table" => [
        'name' => "Название",
        'price' => "Цена",
        "count" => "Количество",
        "total" => "Итого",
    ],
    'popup' => [
        'countChoice' => "товар|товара|товаров",
        'empty' => "Корзина пуста :(",
        'subtotal' => "Промежуточный итог <b>:count</b>",
    ],
    'inputs' => [
        'enter_key' => "Нажмите Enter, чтобы обновить",
    ],
    'totals' => [
        'title' => 'Всего',
        'subtotal' => [
            'title' => 'Промежуточный итог',
            'taxes' => 'Налоги уже включены',
        ],
        'shipping' => [
            'title' => 'Доставка',
            'upon' => 'При оформлении заказа',
        ],
        'total' => 'Всего',
        'checkout' => 'Перейти к оформлению заказа',
    ],
    "empty" => [
        "title" => "Корзина пуста",
        "description" => "Ваша корзина пуста. Выберите товары и добавьте их в корзину.",
        "atHome" => "Вернуться на главную",

        "popular" => [
            "title" => "Популярные товары",
            "description" => "Популярные товары, которые Вы можете добавить в корзину.",

            'content' => [
                'title' => 'Нет популярных товаров',
                'description' => 'Пока нет популярных товаров.',
            ]
        ]
    ],
];
