<?php

return [
    "input" => [
        "placeholder" => "Поиск запчастей среди :count товаров...",
        'button' => 'Поиск',
    ],
    "auth" => [
        'login' => 'Войти',
        'register' => 'Регистрация',
        'text' => "Пожалуйста, войдите или зарегистрируйтесь, чтобы продолжить.",
    ],
    "dropdown" => [
        'welcome' => 'Добро пожаловать, <b>:name</b>!',
        'main' => 'Главная',
        'cart' => 'Моя корзина',
        'my_profile' => 'Мой профиль',
        'my_orders' => 'Мои заказы',
        'filament' => 'Админ-панель',
        'logout' => 'Выйти',
    ],
];
